src/VirtualClient/VirtualClient.Actions.UnitTests/Examples/Memtier/Memtier_Memcached_Results_3.txt
4         Threads
1         Connections per thread
60        Seconds


ALL STATS
============================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p90 Latency     p95 Latency     p99 Latency   p99.9 Latency       KB/sec
------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets         4791.00          ---          ---         2.67920         2.83100         3.95100         4.51100         8.38300        35.83900       326.98
Gets        43118.78     43118.78         0.00         2.64020         2.75100         3.90300         4.44700         7.96700        34.81500      3696.12
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---          ---
Totals      47909.78     43118.78         0.00         2.64410         2.75100         3.91900         4.44700         7.99900        35.07100      4023.11


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.063        0.000
SET       0.359        5.000
SET       0.511       10.000
SET       0.775       15.000
SET       1.127       20.000
SET       1.519       25.000
SET       1.887       30.000
SET       2.207       35.000
SET       2.447       40.000
SET       2.655       45.000
SET       2.831       50.000
SET       2.895       52.500
SET       2.959       55.000
SET       3.007       57.500
SET       3.055       60.000
SET       3.103       62.500
SET       3.135       65.000
SET       3.183       67.500
SET       3.231       70.000
SET       3.279       72.500
SET       3.343       75.000
SET       3.375       76.250
SET       3.423       77.500
SET       3.471       78.750
SET       3.519       80.000
SET       3.551       81.250
SET       3.615       82.500
SET       3.663       83.750
SET       3.711       85.000
SET       3.759       86.250
SET       3.823       87.500
SET       3.839       88.125
SET       3.871       88.750
SET       3.919       89.375
SET       3.951       90.000
SET       3.999       90.625
SET       4.047       91.250
SET       4.095       91.875
SET       4.159       92.500
SET       4.223       93.125
SET       4.319       93.750
SET       4.351       94.062
SET       4.383       94.375
SET       4.447       94.688
SET       4.511       95.000
SET       4.575       95.312
SET       4.639       95.625
SET       4.735       95.938
SET       4.831       96.250
SET       4.991       96.562
SET       5.151       96.875
SET       5.247       97.031
SET       5.375       97.188
SET       5.503       97.344
SET       5.663       97.500
SET       5.823       97.656
SET       5.983       97.812
SET       6.207       97.969
SET       6.431       98.125
SET       6.655       98.281
SET       6.911       98.438
SET       7.039       98.516
SET       7.199       98.594
SET       7.359       98.672
SET       7.583       98.750
SET       7.743       98.828
SET       7.999       98.906
SET       8.319       98.984
SET       8.639       99.062
SET       9.023       99.141
SET       9.471       99.219
SET       9.727       99.258
SET       9.983       99.297
SET      10.303       99.336
SET      10.815       99.375
SET      11.647       99.414
SET      12.607       99.453
SET      13.631       99.492
SET      15.039       99.531
SET      16.255       99.570
SET      17.919       99.609
SET      18.687       99.629
SET      19.327       99.648
SET      19.967       99.668
SET      20.991       99.688
SET      21.887       99.707
SET      23.039       99.727
SET      24.447       99.746
SET      25.855       99.766
SET      27.263       99.785
SET      28.671       99.805
SET      29.055       99.814
SET      29.439       99.824
SET      30.207       99.834
SET      30.847       99.844
SET      31.359       99.854
SET      31.999       99.863
SET      33.535       99.873
SET      34.559       99.883
SET      35.583       99.893
SET      36.095       99.902
SET      36.607       99.907
SET      37.119       99.912
SET      37.631       99.917
SET      38.399       99.922
SET      38.911       99.927
SET      39.423       99.932
SET      39.935       99.937
SET      40.959       99.941
SET      41.471       99.946
SET      42.239       99.951
SET      42.495       99.954
SET      42.751       99.956
SET      43.519       99.958
SET      44.543       99.961
SET      44.799       99.963
SET      45.055       99.966
SET      45.311       99.968
SET      45.823       99.971
SET      46.847       99.973
SET      47.615       99.976
SET      47.871       99.977
SET      47.871       99.978
SET      48.383       99.979
SET      48.639       99.980
SET      48.895       99.982
SET      48.895       99.983
SET      49.919       99.984
SET      50.431       99.985
SET      51.455       99.987
SET      51.967       99.988
SET      53.503       99.988
SET      53.759       99.989
SET      53.759       99.990
SET      54.527       99.990
SET      54.783       99.991
SET      55.039       99.991
SET      56.319       99.992
SET      56.319       99.993
SET      58.623       99.993
SET      58.623       99.994
SET      59.647       99.994
SET      59.903       99.995
SET      60.671       99.995
SET      60.671       99.995
SET      60.671       99.995
SET      60.671       99.996
SET      60.671       99.996
SET      62.207       99.996
SET      62.207       99.997
SET      62.207       99.997
SET      62.207       99.997
SET      62.463       99.997
SET      62.463       99.997
SET      62.463       99.998
SET      70.143       99.998
SET      70.143       99.998
SET      70.143       99.998
[...]
SET      70.143       99.999
SET      70.143       99.999
SET      70.143       99.999
[...]
SET      73.727       99.999
SET      73.727       99.999
SET      73.727       99.999
[...]
SET      74.239       99.999
SET      74.239      100.000
---
GET       0.063        0.000
GET       0.367        5.000
GET       0.607       10.000
GET       0.879       15.000
GET       1.191       20.000
GET       1.527       25.000
GET       1.855       30.000
GET       2.143       35.000
GET       2.367       40.000
GET       2.575       45.000
GET       2.751       50.000
GET       2.831       52.500
GET       2.895       55.000
GET       2.959       57.500
GET       3.007       60.000
GET       3.055       62.500
GET       3.103       65.000
GET       3.151       67.500
GET       3.199       70.000
GET       3.247       72.500
GET       3.311       75.000
GET       3.327       76.250
GET       3.375       77.500
GET       3.423       78.750
GET       3.455       80.000
GET       3.519       81.250
GET       3.567       82.500
GET       3.615       83.750
GET       3.663       85.000
GET       3.727       86.250
GET       3.775       87.500
GET       3.807       88.125
GET       3.839       88.750
GET       3.871       89.375
GET       3.903       90.000
GET       3.951       90.625
GET       3.999       91.250
GET       4.047       91.875
GET       4.127       92.500
GET       4.191       93.125
GET       4.255       93.750
GET       4.287       94.062
GET       4.351       94.375
GET       4.383       94.688
GET       4.447       95.000
GET       4.479       95.312
GET       4.575       95.625
GET       4.639       95.938
GET       4.735       96.250
GET       4.863       96.562
GET       5.023       96.875
GET       5.119       97.031
GET       5.215       97.188
GET       5.343       97.344
GET       5.471       97.500
GET       5.631       97.656
GET       5.823       97.812
GET       6.015       97.969
GET       6.207       98.125
GET       6.463       98.281
GET       6.687       98.438
GET       6.847       98.516
GET       6.975       98.594
GET       7.103       98.672
GET       7.295       98.750
GET       7.519       98.828
GET       7.679       98.906
GET       7.935       98.984
GET       8.255       99.062
GET       8.639       99.141
GET       8.959       99.219
GET       9.215       99.258
GET       9.407       99.297
GET       9.727       99.336
GET       9.919       99.375
GET      10.367       99.414
GET      10.943       99.453
GET      11.839       99.492
GET      13.055       99.531
GET      14.335       99.570
GET      15.679       99.609
GET      16.511       99.629
GET      17.407       99.648
GET      18.431       99.668
GET      19.327       99.688
GET      19.967       99.707
GET      21.119       99.727
GET      22.271       99.746
GET      23.679       99.766
GET      25.215       99.785
GET      26.879       99.805
GET      27.775       99.814
GET      28.543       99.824
GET      29.055       99.834
GET      29.311       99.844
GET      30.207       99.854
GET      30.847       99.863
GET      31.487       99.873
GET      32.639       99.883
GET      33.791       99.893
GET      35.327       99.902
GET      35.583       99.907
GET      35.839       99.912
GET      36.351       99.917
GET      36.863       99.922
GET      37.375       99.927
GET      38.143       99.932
GET      38.911       99.937
GET      39.679       99.941
GET      40.447       99.946
GET      41.215       99.951
GET      41.727       99.954
GET      41.983       99.956
GET      42.495       99.958
GET      42.751       99.961
GET      43.519       99.963
GET      44.543       99.966
GET      44.543       99.968
GET      45.055       99.971
GET      45.823       99.973
GET      46.335       99.976
GET      46.847       99.977
GET      46.847       99.978
GET      47.615       99.979
GET      47.871       99.980
GET      47.871       99.982
GET      48.639       99.983
GET      48.895       99.984
GET      49.151       99.985
GET      49.919       99.987
GET      51.455       99.988
GET      51.455       99.988
GET      53.503       99.989
GET      53.759       99.990
GET      53.759       99.990
GET      54.783       99.991
GET      54.783       99.991
GET      55.039       99.992
GET      55.039       99.993
GET      56.319       99.993
GET      58.623       99.994
GET      58.623       99.994
GET      58.623       99.995
GET      58.623       99.995
GET      59.903       99.995
GET      60.671       99.995
GET      60.671       99.996
GET      60.671       99.996
GET      60.671       99.996
GET      62.207       99.997
GET      62.207       99.997
GET      62.207       99.997
[...]
GET      62.463       99.998
GET      62.719       99.998
GET      70.143       99.998
GET      70.143       99.998
GET      70.143       99.998
[...]
GET      70.143       99.999
GET      70.143       99.999
GET      70.143       99.999
[...]
GET      73.727       99.999
GET      73.727       99.999
GET      73.727       99.999
GET      74.239       99.999
GET      74.239      100.000
---
WAIT      0.000      100.000